content/posts/Geometry_of_physics_by_Urs_Schreiber.md
+++
title = "Geometry of physics by Urs Schreiber"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:34-04:00
slug = "Geometry_of_physics_by_Urs_Schreiber"
draft = false
+++

## Schreiber, U. (2016). Higher prequantum geometry. Retrieved from <http://arxiv.org/abs/1601.05956> {#schreiber-u-dot--2016--dot-higher-prequantum-geometry-dot-retrieved-from-http-arxiv-dot-org-abs-1601-dot-05956}


## [Geometry of physics on nlab](<https://ncatlab.org/nlab/show/geometry+of+physics>) {#geometry-of-physics-on-nlab--https-ncatlab-dot-org-nlab-show-geometry-plus-of-plus-physics}


## 0. Preliminaries on categories and toposes {#0-dot-preliminaries-on-categories-and-toposes}


## I. Geometry {#i-dot-geometry}


### 1. Smooth sets {#1-dot-smooth-sets}

<!--list-separator-->

-  Overview

    <!--list-separator-->

    -  Generalized sets equipped with smooth structure called smooth sets

    <!--list-separator-->

    -  Smooth sets are generalized to smooth homotopy types, smooth h-sets, or smooth 0-types

    <!--list-separator-->

    -  The definition of smooth sets is valuable because it is both simpler and more powerful than those it subsumes, which includes smooth manifolds, Frechet manifolds, and diffeological spaces

    <!--list-separator-->

    -  The category of smooth sets is the topos of sheaves on the gros site of Cartesian spaces that contains as full subcategories smooth manifolds and diffeological spaces

<!--list-separator-->

-  1.1 Abstract coordinate systems

    <!--list-separator-->

    -  Overview

        <!--list-separator-->

        -  Every kind of geometry is modeled on a collection of archetypical basic spaces and geometric homorphisms between them

        <!--list-separator-->

        -  In differential geometry the

            <!--list-separator-->

            -  1) archetypical spaces are abstract standard Cartesian coordinate systems, \\[\mathbb{R}^n\\]

            <!--list-separator-->

            -  2) archetypical geometric homomorphisms between them are smooth functions \\[\mathbb{R}^{n\_1} \rightarrow \mathbb{R}^{n\_2}\\] that are sometimes referred to as coordinate transformations

    <!--list-separator-->

    -  1.1.1 The continuum real line

        <!--list-separator-->

        -  The fundamental premise for using differential geometry as a model of geometry for physics is that the abstract worldline of any particle can be modeled by the continuum real line \\[\mathbb{R}\\]

        <!--list-separator-->

        -

    <!--list-separator-->

    -  1.1.2 Cartesian spaces and smooth functions

    <!--list-separator-->

    -  1.1.3 The magic properties of smooth functions

    <!--list-separator-->

    -  1.1.4 The site of abstract coordinate systems

<!--list-separator-->

-  1.2 Smooth sets

    <!--list-separator-->

    -  1.2.1 Plots of smooth sets and their gluing

    <!--list-separator-->

    -  1.2.2 Homomorphisms of smooth sets

    <!--list-separator-->

    -  1.2.3 Products and fiber products of smooth sets

    <!--list-separator-->

    -  1.2.4 Smooth mapping spaces and smooth moduli spaces

    <!--list-separator-->

    -  1.2.5 The cohesive topos of smooth sets

    <!--list-separator-->

    -  1.2.6 Concrete smooth sets: diffeological spaces

    <!--list-separator-->

    -  1.2.7 Differential forms

    <!--list-separator-->

    -  1.2.8 Integration and transgression


### 2. Smooth homotopy types {#2-dot-smooth-homotopy-types}


### 3. Stable homotopy types {#3-dot-stable-homotopy-types}


### 4. Groups {#4-dot-groups}


### 5. [principal bundle]({{< relref "principal_bundle" >}})s {#5-dot-principal-bundle--principal-bundle-dot-md--s}


### 6. Manifolds and orbifolds {#6-dot-manifolds-and-orbifolds}


### 7. G-structure and Cartan geometry {#7-dot-g-structure-and-cartan-geometry}


### 8. Representations and associated bundles {#8-dot-representations-and-associated-bundles}


### 9. Modules {#9-dot-modules}


### 10. Flat connections {#10-dot-flat-connections}


### 11. de Rham coefficients {#11-dot-de-rham-coefficients}


### 12. Principal connections {#12-dot-principal-connections}


### 13. Integration {#13-dot-integration}


### 14. Super-geometry {#14-dot-super-geometry}


## I-5. Transition {#i-5-dot-transition}


### 1. Prequantum geometry {#1-dot-prequantum-geometry}


### 2. WZW terms {#2-dot-wzw-terms}


### 3. BPS charges {#3-dot-bps-charges}


## II. Physics {#ii-dot-physics}


### 1. Perturbative quantum field theory {#1-dot-perturbative-quantum-field-theory}

<!--list-separator-->

-  1. Geometry

<!--list-separator-->

-  2. Spacetime

<!--list-separator-->

-  3. Fields

<!--list-separator-->

-  4. Field variations

<!--list-separator-->

-  5. Lagrangians

<!--list-separator-->

-  6. Symmetries

<!--list-separator-->

-  7. Observables

<!--list-separator-->

-  8. Phase space

<!--list-separator-->

-  9. Propagators

<!--list-separator-->

-  10. Gauge symmetries

<!--list-separator-->

-  11. Reduced phase space

<!--list-separator-->

-  12. Gauge fixing

<!--list-separator-->

-  13. Quantization

<!--list-separator-->

-  14. Free quantum fields

<!--list-separator-->

-  15. Interacting quantum fields

<!--list-separator-->

-  16. Renormalization


### 2. Physics in higher geometry: motivation and survey {#2-dot-physics-in-higher-geometry-motivation-and-survey}


### 3. Hamilton-Jacobi-Lagrange mechanics via prequantized Lagrangian correspondences {#3-dot-hamilton-jacobi-lagrange-mechanics-via-prequantized-lagrangian-correspondences}


### 4. Hamilton-de Donder-Wyel field theory via higher correspondences {#4-dot-hamilton-de-donder-wyel-field-theory-via-higher-correspondences}


### 5. Local topological prequantum field theory {#5-dot-local-topological-prequantum-field-theory}


### 6. Prequantum gauge theory and gravity {#6-dot-prequantum-gauge-theory-and-gravity}


### 7. Quantum mechanics {#7-dot-quantum-mechanics}


### 8. Geometric quantization {#8-dot-geometric-quantization}
